11/data/attachments/9827fa0d8c4508f4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cccdb5a6-ee86-4345-91c9-d1cf209bb9ab</nif:username>
            <nif:friendToBeAdded>Emily_pattern_Friend_29568_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>